web/tutorials/precice/monolithic/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.841496e-4;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.841496e-4;
    }
    walls
    {
        //type            kqRWallFunction;
        type            kLowReWallFunction;
        value           uniform 1.841496e-4;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.841496e-4;
        value           uniform 1.841496e-4;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 1.841496e-4;
        value           uniform 1.841496e-4;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
